cases/artigo_mestrado/old/on-fsi-3/fluid/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// LCR (CSF) Newtoniano water-like:
//   rho = 1000 kg/m^3 (98-100% agua)
//   mu  = 1.0 mPa.s = 1.0e-3 Pa.s (literatura: 0.7-1.0 mPa.s a 37C)
//   nu  = mu / rho  = 1.0e-6 m^2/s

nu              nu  [0 2 -1 0 0 0 0] 1.0e-6;
rho             rho [1 -3 0 0 0 0 0] 1000;
mu              mu  [1 -1 -1 0 0 0 0] 1.0e-3;

transportModel  Newtonian;
