cases/artigo_mestrado/old/on-fsi-3/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// preCICE adapter (lado FLUIDO).
//   Escreve 'Force' (integral pressao*area + tensao viscosa) nas 4 patches
//   FSI -> mapeado para Solid-Mesh.
//   Le 'Displacement' do solido para mover a malha do fluido (two-way).

preciceConfig "../precice-config.xml";

participant Fluid;

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh              Fluid-Mesh;
        patches           ( fsi_pia fsi_dura fsi_sclera_peri fsi_sclera_ring );
        locations         faceCenters;

        readData          ( Displacement );
        writeData         ( Force );
    };
};

FSI
{
    // rho usado pelo adapter para converter p_kinematico * rho * S em Force
    rho rho [1 -3 0 0 0 0 0] 1000;
}
